sundevilmotorsports/ESP32_Receiver/main/ESP32_Receiver.c
#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <string.h>
#include <assert.h>
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/timers.h"
#include "freertos/queue.h"
#include "freertos/task.h"
#include "nvs_flash.h"
#include "esp_event.h"
#include "esp_netif.h"
#include "esp_wifi.h"
#include "esp_log.h"
#include "esp_mac.h"
#include "esp_now.h"
#include "esp_crc.h"
#include "esp_timer.h"
#include "ESP32_Receiver.h"
#include "esp_heap_caps.h"
#include "server.h"

#define ESPNOW_QUEUE_SIZE 16
#define ACK_TIMER_INTERVAL_MS (15 * 1000)
#define PING_TIMER_INTERVAL_MS (10 * 1000)
#define MAX_PING_MS (11 * 1000);

static QueueHandle_t s_espnow_queue;
static mac_address_list_t mac_list;

mac_address_list_t* get_mac_list(void) {
    return &mac_list;
}

static TimerHandle_t ack_timer;
static TimerHandle_t ping_timer;

static const char *TAG = "receiver";

uint16_t s_espnow_seq[ESPNOW_DATA_MAX] = { 0, 0 };

// single definition of lastTelemetryPing (declared extern in the header)
uint32_t lastTelemetryPing = 0;

const segment_t segments[] = {
    { 0x01,  1,  0, "drs"       },
    { 0x02,  6,  1, "imu_gyro"  },
    { 0x03,  6,  7, "imu_accel" },
    { 0x04,  6, 13, "wheel_fl"  },
    { 0x05,  6, 19, "wheel_fr"  },
    { 0x06,  6, 25, "wheel_rr"  },
    { 0x07,  6, 31, "wheel_rl"  },
    { 0x08,  2, 37, "sg_fl"     },
    { 0x09,  2, 39, "sg_fr"     },
    { 0x0A,  2, 41, "sg_rr"     },
    { 0x0B,  2, 43, "sg_rl"     },
    { 0x0C,  7, 45, "eng_f0"    },
    { 0x0D,  7, 52, "eng_f1"    },
    { 0x0E,  4, 59, "eng_f2"    },
    { 0x0F,  3, 63, "shifter"   },
};
const int NUM_SEGMENTS = sizeof(segments) / sizeof(segments[0]);

void mac_to_string(const uint8_t *mac_addr, char *mac_string) {
    snprintf(mac_string, 18, "%02x:%02x:%02x:%02x:%02x:%02x",
             mac_addr[0], mac_addr[1], mac_addr[2],
             mac_addr[3], mac_addr[4], mac_addr[5]);
}


static TaskHandle_t ack_task_handle = NULL;
static TaskHandle_t ping_task_handle = NULL;

void ack_timer_callback(TimerHandle_t xTimer) {
    if (ack_task_handle != NULL) {
        xTaskNotifyGive(ack_task_handle);
    }
}

void ack_task(void *pvParameter) {
    while (1) {
        // Wait for timer notification
        ulTaskNotifyTake(pdTRUE, portMAX_DELAY);

        ESP_LOGI(TAG, "Broadcasting ACK message");
        send_ack(s_broadcast_mac);
    }
}

void ping_timer_callback(TimerHandle_t xTimer) {
    if (ping_task_handle != NULL) {
        xTaskNotifyGive(ping_task_handle);
    }
}

void ping_task(void *pvParameter) {
    for (;;) {
        ulTaskNotifyTake(pdTRUE, portMAX_DELAY);

        ESP_LOGI(TAG, "Sending pings");
        send_pings();
    }
}

void send_pings() {
    espnow_data_t *buf = malloc(sizeof(espnow_data_t));
    if (buf == NULL) {
        ESP_LOGE(TAG, "Malloc send buffer fail");
        return;
    }

    buf->type = ESPNOW_DATA_PING;
    buf->seq_num = s_espnow_seq[ESPNOW_DATA_UNICAST]++;
    buf->crc = 0;
    buf->crc = esp_crc16_le(UINT16_MAX, (uint8_t const *)buf, sizeof(espnow_data_t));

    for (size_t i = 0; i < mac_list.count; i++) {
        const uint8_t *dest_mac = mac_list.mac_list[i].addr;

        if (!esp_now_is_peer_exist(dest_mac)) {
            esp_now_peer_info_t peer;
            memset(&peer, 0, sizeof(esp_now_peer_info_t));
            peer.channel = 1;
            peer.ifidx = ESP_IF_WIFI_STA;
            peer.encrypt = false;
            memcpy(peer.peer_addr, dest_mac, ESP_NOW_ETH_ALEN);
            ESP_ERROR_CHECK(esp_now_add_peer(&peer));
        }

        const esp_err_t ret = esp_now_send(dest_mac, (uint8_t *)buf, sizeof(espnow_data_t));
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Send ping error: %s", esp_err_to_name(ret));
        } else {
            ESP_LOGI(TAG, "Sent ping to " MACSTR, MAC2STR(dest_mac));
        }

        vTaskDelay(pdMS_TO_TICKS(50));

        if ((esp_timer_get_time() - mac_list.mac_list[i].lastPing) > 11 * 1000 * 1000ULL) {
            ESP_LOGW(TAG, "No ping response from: "MACSTR"", MAC2STR(mac_list.mac_list[i].addr));
        }
    }

    ESP_LOGI(TAG, "Macs:");
    for (size_t j = 0; j < mac_list.count; j++) {
        ESP_LOGI(TAG, MACSTR, MAC2STR(mac_list.mac_list[j].addr));
    }

    free(buf);
}

static void wifi_event_handler(void* arg, esp_event_base_t event_base, int32_t event_id, void* event_data) {
    if (event_id == WIFI_EVENT_AP_STACONNECTED) {
        wifi_event_ap_staconnected_t* event = (wifi_event_ap_staconnected_t*) event_data;
        ESP_LOGI(TAG, "Station "MACSTR" joined, AID=%d", MAC2STR(event->mac), event->aid);
    } else if (event_id == WIFI_EVENT_AP_STADISCONNECTED) {
        wifi_event_ap_stadisconnected_t* event = (wifi_event_ap_stadisconnected_t*) event_data;
        ESP_LOGI(TAG, "Station "MACSTR" left, AID=%d", MAC2STR(event->mac), event->aid);
    } else if (event_id == WIFI_EVENT_AP_START) {
        ESP_LOGI(TAG, "WiFi soft AP started");
    } else if (event_id == WIFI_EVENT_AP_STOP) {
        ESP_LOGI(TAG, "WiFi soft AP stopped");
    }
}

static void wifi_init(void) {
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());

    esp_netif_create_default_wifi_sta();
    esp_netif_create_default_wifi_ap();

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK( esp_wifi_init(&cfg) );
    ESP_ERROR_CHECK( esp_wifi_set_storage(WIFI_STORAGE_RAM) );

    ESP_ERROR_CHECK( esp_wifi_set_mode(WIFI_MODE_APSTA) );

    ESP_ERROR_CHECK(esp_event_handler_register(WIFI_EVENT, ESP_EVENT_ANY_ID, &wifi_event_handler, NULL));

    ESP_ERROR_CHECK( esp_wifi_start());
    ESP_ERROR_CHECK( esp_wifi_set_channel(1, WIFI_SECOND_CHAN_NONE));
    ESP_ERROR_CHECK( esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_11B|WIFI_PROTOCOL_11G|WIFI_PROTOCOL_11N|WIFI_PROTOCOL_LR) );
}

void espnow_send_cb(const esp_now_send_info_t *tx_info, esp_now_send_status_t status) {
    espnow_event_t evt;
    event_send_cb_t *send_cb = &evt.info.send_cb;

    if (tx_info == NULL) {
        ESP_LOGE(TAG, "Send cb arg error");
        return;
    }

    evt.id = ESPNOW_SEND_CB;
    memcpy(send_cb->mac_addr, tx_info->des_addr, ESP_NOW_ETH_ALEN);
    send_cb->status = status;
    if (xQueueSend(s_espnow_queue, &evt, ESPNOW_MAXDELAY) != pdTRUE) {
        ESP_LOGW(TAG, "Send send queue fail");
    }
}

void espnow_recv_cb(const esp_now_recv_info_t *recv_info, const uint8_t *data, int len) {
    espnow_event_t evt;
    event_recv_cb_t *recv_cb = &evt.info.recv_cb;
    uint8_t * mac_addr = recv_info->src_addr;

