sundevilmotorsports/ESP32_Receiver/main/ESP32_Receiver.c
    if (mac_addr == NULL || data == NULL || len <= 0) {
        ESP_LOGE(TAG, "Receive cb arg error");
        return;
    }

    if (esp_get_free_heap_size() < 10000) {
        ESP_LOGW(TAG, "Heap low (%lu bytes), dropping packet", esp_get_free_heap_size());
        return;
    }

    evt.id = ESPNOW_RECV_CB;
    memcpy(recv_cb->mac_addr, mac_addr, ESP_NOW_ETH_ALEN);
    recv_cb->data = malloc(len);
    if (recv_cb->data == NULL) {
        ESP_LOGE(TAG, "Malloc receive data fail");
        return;
    }
    memcpy(recv_cb->data, data, len);
    recv_cb->data_len = len;
    if (xQueueSend(s_espnow_queue, &evt, ESPNOW_MAXDELAY) != pdTRUE) {
        ESP_LOGW(TAG, "Send receive queue fail");
        free(recv_cb->data);
    }
}

int espnow_data_parse(uint8_t *data, uint16_t data_len, uint8_t *state, uint16_t *seq, int *magic) {
    espnow_data_t *buf = (espnow_data_t *)data;
    uint16_t crc, crc_cal = 0;

    if (data_len < offsetof(espnow_data_t, data)) {
        ESP_LOGE(TAG, "Receive ESPNOW data too short, len:%d", data_len);
        return -1;
    }

    *seq = buf->seq_num;
    crc = buf->crc;
    buf->crc = 0;
    crc_cal = esp_crc16_le(UINT16_MAX, (uint8_t const *)buf, data_len);

    // if (crc_cal == crc) {
    //     return buf->type;
    // }

    return buf->type;
}

void add_mac_to_list(const uint8_t *mac_addr) {
    if (mac_list.count >= MAX_MAC_ADDRESSES) {
        ESP_LOGW(TAG, "MAC address list is full");
        return;
    }

    if (is_mac_in_list(mac_addr)) {
        return;
    }

    memcpy(mac_list.mac_list[mac_list.count].addr, mac_addr, ESP_NOW_ETH_ALEN);
    mac_list.count++;

    ESP_LOGI(TAG, "Added MAC to list: " MACSTR " (Total: %d)", MAC2STR(mac_addr), mac_list.count);
}

bool is_mac_in_list(const uint8_t *mac_addr) {
    for (int i = 0; i < mac_list.count; i++) {
        if (memcmp(mac_list.mac_list[i].addr, mac_addr, ESP_NOW_ETH_ALEN) == 0) {
            return true;
        }
    }
    return false;
}

void send_ack(const uint8_t *dest_mac) {
    espnow_data_t *buf = malloc(sizeof(espnow_data_t));
    if (buf == NULL) {
        ESP_LOGE(TAG, "Malloc send buffer fail");
        return;
    }

    buf->type = ESPNOW_DATA_ACK;
    buf->seq_num = s_espnow_seq[ESPNOW_DATA_UNICAST]++;
    buf->crc = 0;
    buf->crc = esp_crc16_le(UINT16_MAX, (uint8_t const *)buf, sizeof(espnow_data_t));

    if (!esp_now_is_peer_exist(dest_mac)) {
        esp_now_peer_info_t peer;
        memset(&peer, 0, sizeof(esp_now_peer_info_t));
        peer.channel = 1;
        peer.ifidx = ESP_IF_WIFI_STA;
        peer.encrypt = false;
        memcpy(peer.peer_addr, dest_mac, ESP_NOW_ETH_ALEN);
        ESP_ERROR_CHECK(esp_now_add_peer(&peer));
    }

    esp_err_t ret = esp_now_send(dest_mac, (uint8_t *)buf, sizeof(espnow_data_t));
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Send ACK error: %s", esp_err_to_name(ret));
    } else {
        ESP_LOGI(TAG, "Sent ACK to " MACSTR, MAC2STR(dest_mac));
    }

    free(buf);
}

void espnow_data_prepare(espnow_send_param_t *send_param) {
    espnow_data_t *buf = (espnow_data_t *)send_param->buffer;

    assert(send_param->len >= sizeof(espnow_data_t));

    buf->type = ESPNOW_DATA_REQUEST;
    buf->seq_num = s_espnow_seq[buf->type]++;
    buf->crc = 0;
    buf->crc = esp_crc16_le(UINT16_MAX, (uint8_t const *)buf, send_param->len);
}

void espnow_task(void *pvParameter) {
    espnow_event_t evt;
    uint8_t recv_state = 0;
    uint16_t recv_seq = 0;
    int recv_magic = 0;
    int ret;
    uint32_t pkt_count = 0;

    while (xQueueReceive(s_espnow_queue, &evt, portMAX_DELAY) == pdTRUE) {
        if (++pkt_count % 100 == 0) {
            ESP_LOGI(TAG, "Heap free: %lu bytes", esp_get_free_heap_size());
        }
        switch (evt.id) {
            case ESPNOW_SEND_CB:
            {
                event_send_cb_t *send_cb = &evt.info.send_cb;
                if (memcmp(send_cb->mac_addr, s_broadcast_mac, ESP_NOW_ETH_ALEN) == 0) {
                    ESP_LOGI(TAG, "Broadcast ACK sent, status: %d", send_cb->status);
                } else {
                    ESP_LOGI(TAG, "Unicast ACK sent to "MACSTR", status: %d", MAC2STR(send_cb->mac_addr), send_cb->status);
                }
                break;
            }
            case ESPNOW_RECV_CB:
            {
                event_recv_cb_t *recv_cb = &evt.info.recv_cb;
                espnow_data_t *packet = (espnow_data_t*)recv_cb->data;

                ret = espnow_data_parse(recv_cb->data, recv_cb->data_len, &recv_state, &recv_seq, &recv_magic);

                if (ret == ESPNOW_DATA_ACK) {
                    ESP_LOGI(TAG, "Received ACK from "MACSTR", seq: %d", MAC2STR(recv_cb->mac_addr), recv_seq);
                    add_mac_to_list(recv_cb->mac_addr);
                } else if (ret == ESPNOW_DATA_REQUEST) {
                    ESP_LOGI(TAG, "Received request from "MACSTR", seq: %d", MAC2STR(recv_cb->mac_addr), recv_seq);

                    size_t payload_len = packet->len;
                    if (payload_len > 0 && payload_len <= sizeof(packet->data)) {
                        char* buffer = malloc(payload_len + 1);
                        if (buffer != NULL) {
                            int index = mac_index(recv_cb->mac_addr);
                            mac_list.mac_list[index].last_data_seq = recv_seq;

                            memcpy(buffer, packet->data, payload_len);
                            buffer[payload_len] = '\0';

                            ESP_LOGI(TAG, "Received data: %s", buffer);

                            char mac_addr_string[18];
                            mac_to_string(recv_cb->mac_addr, mac_addr_string);

                            addGateTime(mac_addr_string, buffer);
                            setGateStuck(mac_addr_string, false);
                            free(buffer);

                            espnow_data_t *ok_pkt = malloc(sizeof(espnow_data_t));
                            if (ok_pkt != NULL) {
                                memset(ok_pkt, 0, sizeof(espnow_data_t));
                                ok_pkt->type    = ESPNOW_DATA_OK;
                                ok_pkt->seq_num = recv_seq;
                                ok_pkt->len     = 0;
                                ok_pkt->crc     = 0;
                                ok_pkt->crc     = esp_crc16_le(UINT16_MAX, (uint8_t const *)ok_pkt, sizeof(espnow_data_t));

                                if (!esp_now_is_peer_exist(recv_cb->mac_addr)) {
                                    esp_now_peer_info_t peer;
                                    memset(&peer, 0, sizeof(esp_now_peer_info_t));
                                    peer.channel = 1;
                                    peer.ifidx   = ESP_IF_WIFI_STA;
                                    peer.encrypt = false;
                                    memcpy(peer.peer_addr, recv_cb->mac_addr, ESP_NOW_ETH_ALEN);
                                    ESP_ERROR_CHECK(esp_now_add_peer(&peer));
                                }

                                esp_err_t ok_ret = esp_now_send(recv_cb->mac_addr, (uint8_t *)ok_pkt, sizeof(espnow_data_t));
                                if (ok_ret != ESP_OK) {
                                    ESP_LOGE(TAG, "Failed to send OK to "MACSTR": %s", MAC2STR(recv_cb->mac_addr), esp_err_to_name(ok_ret));
                                } else {
                                    ESP_LOGI(TAG, "Sent OK for seq %d to "MACSTR"", recv_seq, MAC2STR(recv_cb->mac_addr));
                                }
                                free(ok_pkt);
                            } else {
                                ESP_LOGE(TAG, "Failed to allocate OK packet");
                            }
                        } else {
                            ESP_LOGE(TAG, "Failed to allocate buffer for received data");
                        }
                    } else {
                        ESP_LOGE(TAG, "Invalid payload length: %zu", payload_len);
                    }
                } else if (ret == ESPNOW_DATA_PING) {
                    ESP_LOGI(TAG, "Received ping from "MACSTR"", MAC2STR(recv_cb->mac_addr));
                    int index = mac_index(recv_cb->mac_addr);
                    if (index == -1) {
                        ESP_LOGW(TAG, "Unable to locate mac in list");
                        add_mac_to_list(recv_cb->mac_addr);
                        index = mac_index(recv_cb->mac_addr);
                    }
                    if (index != -1) {
                        mac_list.mac_list[index].lastPing = esp_timer_get_time();
                    }
                } else if (ret == ESPNOW_TELEMETRY) {
                    uint32_t time_ms = esp_timer_get_time() / (int64_t)1000;
                    char time_str[16];
                    snprintf(time_str, sizeof(time_str), "%lu", time_ms - lastTelemetryPing);
                    addString("telemetryPing", time_str);
                    lastTelemetryPing = time_ms;

                    const uint8_t *payload = packet->data;
                    size_t payload_len = packet->len;

                    for (int s = 0; s < NUM_SEGMENTS; s++) {
                        if ((size_t)(segments[s].offset + segments[s].len) > payload_len) {
                            ESP_LOGW(TAG, "Packet too short for segment %s (offset=%d end=%d pkt_len=%zu)",
                                     segments[s].name, segments[s].offset,
                                     segments[s].offset + segments[s].len, payload_len);
                            continue;
                        }

