sundevilmotorsports/ESP32_Receiver/main/ESP32_Receiver.c
                        const uint8_t *d = &payload[segments[s].offset];

                        if (segments[s].id == 0x02) { // IMU Gyro
                            int16_t gx = (int16_t)((d[0] << 8) | d[1]);
                            int16_t gy = (int16_t)((d[2] << 8) | d[3]);
                            int16_t gz = (int16_t)((d[4] << 8) | d[5]);
                            char conv[64];
                            snprintf(conv, sizeof(conv), "%.2f,%.2f,%.2f",
                                     gx * 17.50f, gy * 17.50f, gz * 17.50f);
                            addString(segments[s].name, conv);
                        } else if (segments[s].id == 0x03) { // IMU Accel
                            int16_t ax = (int16_t)((d[0] << 8) | d[1]);
                            int16_t ay = (int16_t)((d[2] << 8) | d[3]);
                            int16_t az = (int16_t)((d[4] << 8) | d[5]);
                            char conv[64];
                            snprintf(conv, sizeof(conv), "%.6f,%.6f,%.6f",
                                     ((float)ax * 0.122f) / 1000.0f,
                                     ((float)ay * 0.122f) / 1000.0f,
                                     ((float)az * 0.122f) / 1000.0f);
                            addString(segments[s].name, conv);
                        } else {
                            char hex[64] = {0};
                            int hpos = 0;
                            for (int b = 0; b < segments[s].len; b++) {
                                hpos += snprintf(hex + hpos, sizeof(hex) - hpos,
                                                 b ? " %02X" : "%02X", d[b]);
                            }
                            addString(segments[s].name, hex);
                        }
                    }
                } else if (ret == ESPNOW_GATE_STUCK) {
                    char mac_addr_string[18];
                    mac_to_string(recv_cb->mac_addr, mac_addr_string);
                    bool is_stuck = (packet->len > 0 && packet->data[0] == 1);
                    ESP_LOGW(TAG, "Gate %s: %s", mac_addr_string, is_stuck ? "STUCK" : "cleared");
                    setGateStuck(mac_addr_string, is_stuck);

                    espnow_data_t *ok_pkt = malloc(sizeof(espnow_data_t));
                    if (ok_pkt != NULL) {
                        memset(ok_pkt, 0, sizeof(espnow_data_t));
                        ok_pkt->type    = ESPNOW_DATA_OK;
                        ok_pkt->seq_num = recv_seq;
                        ok_pkt->len     = 0;
                        ok_pkt->crc     = 0;
                        ok_pkt->crc     = esp_crc16_le(UINT16_MAX, (uint8_t const *)ok_pkt, sizeof(espnow_data_t));

                        if (!esp_now_is_peer_exist(recv_cb->mac_addr)) {
                            esp_now_peer_info_t peer;
                            memset(&peer, 0, sizeof(esp_now_peer_info_t));
                            peer.channel = 1;
                            peer.ifidx   = ESP_IF_WIFI_STA;
                            peer.encrypt = false;
                            memcpy(peer.peer_addr, recv_cb->mac_addr, ESP_NOW_ETH_ALEN);
                            ESP_ERROR_CHECK(esp_now_add_peer(&peer));
                        }

                        esp_now_send(recv_cb->mac_addr, (uint8_t *)ok_pkt, sizeof(espnow_data_t));
                        free(ok_pkt);
                    }
                } else {
                    ESP_LOGI(TAG, "Received invalid data from: "MACSTR"", MAC2STR(recv_cb->mac_addr));
                }

                free(recv_cb->data);
                break;
            }
            default:
                ESP_LOGE(TAG, "Callback type error: %d", evt.id);
                break;
        }
    }
}

int mac_index(const uint8_t *mac_addr) {
    uint8_t idx = 0;
    for (int i = 0; i < mac_list.count; i++) {
        if (memcmp(mac_addr, mac_list.mac_list[i].addr, ESP_NOW_ETH_ALEN) == 0) {
            return idx;
        }

        idx++;
    }

    return -1;
}

esp_err_t softap_init(void) {
    wifi_config_t wifi_ap_config = {
        .ap = {
            .ssid = SOFTAP_SSID,
            .ssid_len = strlen(SOFTAP_SSID),
            .channel = SOFTAP_CHANNEL,
            .password = SOFTAP_PASS,
            .max_connection = MAX_STA_CONN,
            .authmode = WIFI_AUTH_WPA2_PSK,
            .pmf_cfg = {
                .required = false,
            },
        },
    };

    ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_AP, &wifi_ap_config));

    ESP_LOGI(TAG, "WiFi soft AP initialized. SSID:%s password:%s channel:%d",
             SOFTAP_SSID, SOFTAP_PASS, SOFTAP_CHANNEL);

    return ESP_OK;
}

esp_err_t espnow_init(void) {
    s_espnow_queue = xQueueCreate(ESPNOW_QUEUE_SIZE, sizeof(espnow_event_t));
    if (s_espnow_queue == NULL) {
        ESP_LOGE(TAG, "Create queue fail");
        return ESP_FAIL;
    }

    ESP_ERROR_CHECK( esp_now_init() );
    ESP_ERROR_CHECK( esp_now_register_send_cb(espnow_send_cb) );
    ESP_ERROR_CHECK( esp_now_register_recv_cb(espnow_recv_cb) );
    ESP_ERROR_CHECK( esp_wifi_set_protocol(ESP_IF_WIFI_STA, WIFI_PROTOCOL_11B|WIFI_PROTOCOL_11G|WIFI_PROTOCOL_11N|WIFI_PROTOCOL_LR) );

    esp_now_peer_info_t *peer = malloc(sizeof(esp_now_peer_info_t));
    if (peer == NULL) {
        ESP_LOGE(TAG, "Malloc peer information fail");
        vQueueDelete(s_espnow_queue);
        esp_now_deinit();
        return ESP_FAIL;
    }
    memset(peer, 0, sizeof(esp_now_peer_info_t));
    peer->channel = 1;
    peer->ifidx = ESP_IF_WIFI_STA;
    peer->encrypt = false;
    memcpy(peer->peer_addr, s_broadcast_mac, ESP_NOW_ETH_ALEN);
    ESP_ERROR_CHECK( esp_now_add_peer(peer) );
    free(peer);

    ack_timer = xTimerCreate("ACK_Timer",
                            pdMS_TO_TICKS(ACK_TIMER_INTERVAL_MS),
                            pdTRUE,  // Auto-reload
                            NULL,    // Timer ID
                            ack_timer_callback);

    if (ack_timer == NULL) {
        ESP_LOGE(TAG, "Failed to create ACK timer");
        vQueueDelete(s_espnow_queue);
        esp_now_deinit();
        return ESP_FAIL;
    }

    if (xTimerStart(ack_timer, 0) != pdPASS) {
        ESP_LOGE(TAG, "Failed to start ACK timer");
        xTimerDelete(ack_timer, 0);
        vQueueDelete(s_espnow_queue);
        esp_now_deinit();
        return ESP_FAIL;
    }

