sundevilmotorsports/ESP32_Receiver/main/ESP32_Receiver.c
    ESP_LOGI(TAG, "ping timer started - will send pings every %d seconds", PING_TIMER_INTERVAL_MS/1000);

    ping_timer = xTimerCreate("ACK_Timer",
                            pdMS_TO_TICKS(PING_TIMER_INTERVAL_MS),
                            pdTRUE,  // Auto-reload
                            NULL,    // Timer ID
                            ping_timer_callback);

    if (ping_timer == NULL) {
        ESP_LOGE(TAG, "Failed to create ACK timer");
        vQueueDelete(s_espnow_queue);
        esp_now_deinit();
        return ESP_FAIL;
    }

    if (xTimerStart(ping_timer, 0) != pdPASS) {
        ESP_LOGE(TAG, "Failed to start ping timer");
        xTimerDelete(ping_timer, 0);
        vQueueDelete(s_espnow_queue);
        esp_now_deinit();
        return ESP_FAIL;
    }

    xTaskCreate(espnow_task, "espnow_task", 8192, NULL, 4, NULL);

    return ESP_OK;
}

void espnow_deinit(espnow_send_param_t *send_param) {
    if (ack_timer != NULL) {
        xTimerStop(ack_timer, 0);
        xTimerDelete(ack_timer, 0);
    }
    if (send_param != NULL) {
        free(send_param->buffer);
        free(send_param);
    }
    vQueueDelete(s_espnow_queue);
    esp_now_deinit();
}

void app_main(void) {
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK( nvs_flash_erase() );
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK( ret );

    wifi_init();
    xTaskCreate(ack_task, "ack_task", 3072, NULL, 3, &ack_task_handle);
    softap_init();
    espnow_init();
    xTaskCreatePinnedToCore(server_start, "server", 6144, NULL, 4, NULL, 1);
    xTaskCreate(ping_task, "ping", 4096, NULL, 5, &ping_task_handle);
}
